# Dropna & Filna & ffill & bfill

In [23]:
import pandas as pd
import numpy as np

## Create a DataFrame

In [24]:
df1 = {
    'Name':['George','Andrea','micheal','maggie','Ravi','Xien','Jalpa',np.nan],
    'State':['Arizona','Georgia','Newyork','Indiana','Florida','California',np.nan,np.nan],
    'Gender':["M","F","M","F","M","M",np.nan,np.nan],
    'Score':[63,48,56,75,np.nan,77,np.nan,np.nan]
}

df1 = pd.DataFrame(df1,columns=['Name','State','Gender','Score'])
display(df1)

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
4     Ravi     Florida      M    NaN
5     Xien  California      M   77.0
6    Jalpa         NaN    NaN    NaN
7      NaN         NaN    NaN    NaN

## Save dataframe as csv five

In [25]:
df1.to_csv("df1.csv")

In [26]:
#print(df1)
#display(df1.head());
display(df1.tail());

#display(df1.dropna())

     Name       State Gender  Score
3  maggie     Indiana      F   75.0
4    Ravi     Florida      M    NaN
5    Xien  California      M   77.0
6   Jalpa         NaN    NaN    NaN
7     NaN         NaN    NaN    NaN

In [27]:
print("Print Dataframe With NaN")
display(df1)

print("Dataframe Without NaN")
display(df1.dropna())

Print Dataframe With NaN

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
4     Ravi     Florida      M    NaN
5     Xien  California      M   77.0
6    Jalpa         NaN    NaN    NaN
7      NaN         NaN    NaN    NaN

Dataframe Without NaN

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
5     Xien  California      M   77.0

## Fill NaN

In [28]:
#df1.fillna(0);
display(df1.fillna(0))

print("inplace=false : don't modify original data frame")
display(df1)

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
4     Ravi     Florida      M    0.0
5     Xien  California      M   77.0
6    Jalpa           0      0    0.0
7        0           0      0    0.0

inplace=false : don't modify original data frame

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
4     Ravi     Florida      M    NaN
5     Xien  California      M   77.0
6    Jalpa         NaN    NaN    NaN
7      NaN         NaN    NaN    NaN

In [29]:
df1 = df1.fillna(0)

In [30]:
# df1.fillna(df1.mean(numeric_only=True), inplace=True)
df1.fillna(df1.select_dtypes(include=['number']).mean(), inplace=True)
display(df1)

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
4     Ravi     Florida      M    0.0
5     Xien  California      M   77.0
6    Jalpa           0      0    0.0
7        0           0      0    0.0

In [31]:
import pandas as pd

# Sample DataFrame with missing values
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, None, 30, 35],
    "Score": [85, 90, None, 88]
}
df1 = pd.DataFrame(data)
display(df1)

      Name   Age  Score
0    Alice  25.0   85.0
1      Bob   NaN   90.0
2  Charlie  30.0    NaN
3    David  35.0   88.0

In [32]:
# Fill missing values with column-wise mean (numeric columns only)
df_filled_mean = df1.fillna(df1.mean(numeric_only=True))
display(df_filled_mean)

      Name   Age      Score
0    Alice  25.0  85.000000
1      Bob  30.0  90.000000
2  Charlie  30.0  87.666667
3    David  35.0  88.000000

In [33]:
print("\nAfter missing value fill-up\n")

# Print the mean of numeric columns
print( df1.mean(numeric_only=True) )

After missing value fill-up

Age      30.000000
Score    87.666667
dtype: float64

In [34]:
# Fill only the "Score" column with its mean
df1["Score"] = df1["Score"].fillna(df1["Score"].mean())  # No numeric_only needed
display(df1)

      Name   Age      Score
0    Alice  25.0  85.000000
1      Bob   NaN  90.000000
2  Charlie  30.0  87.666667
3    David  35.0  88.000000

In [35]:
# Fill all missing values with 0
df_filled_zero = df1.fillna(0)
display(df_filled_zero)

      Name   Age      Score
0    Alice  25.0  85.000000
1      Bob   0.0  90.000000
2  Charlie  30.0  87.666667
3    David  35.0  88.000000

# New Dataframe & Handle Missing Value

In [36]:
import pandas as pd
import numpy as np
# Sample DataFrame with missing values
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", None],
    "Age": [25, np.nan, 30, 35, 40],
    "Score": [85, 90, np.nan, 88, 92],
    "City": ["New York", "Los Angeles", None, "Chicago", "Houston"]
}
df = pd.DataFrame(data)
print("Original DataFrame with Missing Values:")
display(df)

Original DataFrame with Missing Values:

      Name   Age  Score         City
0    Alice  25.0   85.0     New York
1      Bob   NaN   90.0  Los Angeles
2  Charlie  30.0    NaN         None
3    David  35.0   88.0      Chicago
4     None  40.0   92.0      Houston

## 1️⃣ Detect Missing Values

In [37]:
print("Missing Value Count:")
display( df.isnull().sum() )

Missing Value Count:

Name     1
Age      1
Score    1
City     1
dtype: int64

## 2️⃣ Drop rows with any missing values

In [38]:
df_drop_rows = df.dropna()
print("After Dropping Rows with Missing Values:")
display(df_drop_rows)

After Dropping Rows with Missing Values:

    Name   Age  Score      City
0  Alice  25.0   85.0  New York
3  David  35.0   88.0   Chicago

## 3️⃣ Drop columns with any missing values

In [39]:
df_drop_cols = df.dropna(axis=1)
print("After Dropping Columns with Missing Values:")
print(df_drop_cols, "\n")

After Dropping Columns with Missing Values:
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

## Drop columns with more than 60% null values

In [ ]:
nan_percentages = df.isnull().sum()/len(df)
cols_to_drop = nan_percentages[nan_percentages>.60].index
df_cleaned = df.drop(columns=cols_to_drop)

display(df_cleaned)

      Name   Age  Score         City
0    Alice  25.0   85.0     New York
1      Bob   NaN   90.0  Los Angeles
2  Charlie  30.0    NaN         None
3    David  35.0   88.0      Chicago
4     None  40.0   92.0      Houston

## 4️⃣ Fill missing numerical values with the mean

In [41]:
df_fill_mean = df.copy()
df_fill_mean["Age"] = df_fill_mean["Age"].fillna(df["Age"].mean())
df_fill_mean["Score"] = df_fill_mean["Score"].fillna(df["Score"].mean())

print("After Filling Numeric Columns with Mean:")
display(df_fill_mean)

After Filling Numeric Columns with Mean:

      Name   Age  Score         City
0    Alice  25.0  85.00     New York
1      Bob  32.5  90.00  Los Angeles
2  Charlie  30.0  88.75         None
3    David  35.0  88.00      Chicago
4     None  40.0  92.00      Houston

## 5️⃣ Fill missing values with a specific value

In [42]:
df_fill_value = df.fillna({"Name": "Unknown", "City": "Unknown", "Age": 0, "Score": 0})
print("After Filling with Specific Values:")
display(df_fill_value)

After Filling with Specific Values:

      Name   Age  Score         City
0    Alice  25.0   85.0     New York
1      Bob   0.0   90.0  Los Angeles
2  Charlie  30.0    0.0      Unknown
3    David  35.0   88.0      Chicago
4  Unknown  40.0   92.0      Houston

<table>
  <thead>
    <tr>
      <th>Method</th>
      <th>Filled By</th>
      <th>Direction</th>
      <th>Example</th>
      <th>Use Case</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td><b>Forward Fill (ffill)</b></td>
      <td>Previous valid value</td>
      <td>Propagate forward</td>
      <td>
        Original: [1, NaN, NaN, 4, 5]<br>
        ffill: [1, 1, 1, 4, 5]
      </td>
      <td>Time series, cumulative data, logs where previous value carries forward</td>
    </tr>
    <tr>
      <td><b>Backward Fill (bfill)</b></td>
      <td>Next valid value</td>
      <td>Propagate backward</td>
      <td>
        Original: [1, NaN, NaN, 4, 5]<br>
        bfill: [1, 4, 4, 4, 5]
      </td>
      <td>Future-looking imputation, backward propagation, preprocessing before forward analysis</td>
    </tr>
  </tbody>
</table>

## 6️⃣ Forward Fill (propagate previous values forward)

In [43]:
# Forward Fill
df_ffill = df.ffill()
print("After Forward Fill:")
display(df_ffill)

After Forward Fill:

      Name   Age  Score         City
0    Alice  25.0   85.0     New York
1      Bob  25.0   90.0  Los Angeles
2  Charlie  30.0   90.0  Los Angeles
3    David  35.0   88.0      Chicago
4    David  40.0   92.0      Houston

## 7️⃣ Backward Fill (propagate next values backward)

In [44]:
# Backward Fill
df_bfill = df.bfill()
print("After Backward Fill:")
display(df_bfill)

After Backward Fill:

      Name   Age  Score         City
0    Alice  25.0   85.0     New York
1      Bob  30.0   90.0  Los Angeles
2  Charlie  30.0   88.0      Chicago
3    David  35.0   88.0      Chicago
4     None  40.0   92.0      Houston

## 8️⃣ Fill missing categorical values with the mode (most frequent value)

In [45]:
df_fill_mode = df.copy()
df_fill_mode["City"] = df_fill_mode["City"].fillna(df["City"].mode()[0])
print("After Filling Categorical Column with Mode:")
display(df_fill_mode)

After Filling Categorical Column with Mode:

      Name   Age  Score         City
0    Alice  25.0   85.0     New York
1      Bob   NaN   90.0  Los Angeles
2  Charlie  30.0    NaN      Chicago
3    David  35.0   88.0      Chicago
4     None  40.0   92.0      Houston

# End